title: Network Service Scanning
id: 27392b9e-22f9-4e83-a0ed-ca1d8cc419f3
status: experimental
description: Detects fan-out network connections from a single source to many destinations on the same port.
author: Alaris Global
references:
  - https://attack.mitre.org/techniques/T1046/
logsource:
  category: network_connection
  product: windows
detection:
  selection:
    Initiated: 'true'
  timeframe: 5m
  condition: selection | count_distinct(DestinationIp) by SourceIp,DestinationPort > 25
fields:
  - SourceIp
  - DestinationPort
  - Image
  - User
falsepositives:
  - Authorized vulnerability scanners
  - Backup or monitoring agents performing wide health checks
level: low
tags:
  - attack.discovery
  - attack.t1046
